import os
import telebot
import logging
from telebot import types
from datetime import datetime
# Импортируем DatabaseManager, в нем вся логика работы с БД
from database_manager import DatabaseManager
# Импортируем функцию настройки логирования из файла с конфигурацией
from my_logger_config import setup_logging
# Вызов функции настройки логирования (ОДИН РАЗ) при запуске программы
setup_logging()

# Получение экземпляра логгера
logger = logging.getLogger(f'my_app.{__name__}')

# --- Инициализация бота и базы данных ---
# Токен в переменной окружения
MY_TOKEN_BOT = os.getenv("API_TOKEN")
bot = telebot.TeleBot(MY_TOKEN_BOT)
# Инициализируем менеджер базы данных
db = DatabaseManager()


# --- Обработчики команд ---
@bot.message_handler(commands=['start'])
def send_welcome(message: types.Message):
    """
    Обрабатывает команду start.
    Создает inline и Reply клавиатуры для кнопок с callback_data - командами и обычными.
    Отправляет пользователю приветственное сообщение с информацией о том, как пользоваться ботом.
    :param message: types.Message: Объект сообщения.
    """
    logger.info('Пользователь вызвал команду /start.')
    # ID пользователя из чата с ботом в телеграмме
    user_id = message.chat.id
    # Имя пользователя в профиле телеграмма
    user_name = message.from_user.first_name if message.from_user.first_name else 'Пользователь'
    # Добавляем пользователя в базу данных при старте
    db.add_user(user_id, user_name)

    # создаем inline клавиатуру
    markup = types.InlineKeyboardMarkup()
    # создаем кнопки с callback_data - командами
    sleep_button = types.InlineKeyboardButton("Сладких снов 😴", callback_data='/sleep')
    wake_button = types.InlineKeyboardButton("Я проснулся ☀", callback_data='/wake')
    quality_button = types.InlineKeyboardButton("Качество сна 💫", callback_data='/quality')
    notes_button = types.InlineKeyboardButton("Заметки 📝", callback_data='/notes')
    recom_button = types.InlineKeyboardButton("Общие рекомендации 🧘🏼‍♀️", callback_data='/recom')
    statis_inl_button = types.InlineKeyboardButton("Статистика сна 📊💤", callback_data='/statis')
    # Добавляем кнопки на клавиатуру
    markup.add(sleep_button, wake_button)
    markup.add(quality_button, notes_button)
    markup.add(recom_button)
    markup.add(statis_inl_button)

    # создаем Reply клавиатуру
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True)
    # создаем кнопки
    start_button = types.KeyboardButton("/start")
    help_button = types.KeyboardButton("/help")
    recom_button_reply = types.KeyboardButton("/recom")
    statis_button = types.KeyboardButton("/statis")
    # добавляем кнопки на клавиатуру
    keyboard.add(help_button, recom_button_reply)
    keyboard.add(start_button, statis_button)

    bot.send_message(message.chat.id, """Привет!
    Я бот, который помогает отслеживать количество и качество сна💤.
    Используйте кнопки или команды:
    /sleep - начало сна. Выбирайте эту команду, когда ложитесь спать!(или кнопка 'Сладких снов 😴')
    /wake - конец сна. Выбирайте эту команду, когда проснулись!(или кнопка 'Я проснулся ☀')
    /quality - оценка качества сна по 5-бальной шкале. Выбирайте эту команду, когда хотите поставить оценку качества своему сну!(или кнопка 'Качество сна 💫')
    /notes - Ваш дневник для заметок. Выбирайте эту команду, когда хотите добавить или обновить комментарий к оценке качества Вашего сна!(или кнопка 'Заметки 📝')
    /recom - общие рекомендации для улучшения качества сна (или кнопка 'Общие рекомендации 🧘🏼‍♀️')
    /statis - cтатистика Вашего сна. Выбирайте эту команду, когда хотите получить статистику Вашего сна, в нее входят:
    общее количество сессий сна, общая и средняя продолжительность сна (или кнопка 'Статистика сна 📊💤')
    /help - пришлю список доступных команд
    /start - перезапуск бота""", reply_markup=markup)
    logger.debug('Отправка приветственного сообщения с клавиатурой.')
    bot.send_message(message.chat.id, """Кнопки с этими командами будут всегда доступны:
    /help - пришлю список доступных команд
    /recom - общие рекомендации для улучшения качества сна
    /statis - статистика сна
    /start - перезапуск бота
    Они находятся под строкой ввода сообщения, или рядом со значком микрофона""", reply_markup=keyboard)
    logger.debug('Отправка дополнительного сообщения с командами, которые всегда доступны.')


@bot.message_handler(commands=['help'])
def handle_help(message: types.Message):
    """
    Обрабатывает команду help.
    Создает inline и Reply клавиатуры для кнопок с callback_data - командами и обычными.
    Отправляет пользователю сообщение с доступными командами и клавиатурой.
    :param message: types.Message: Объект сообщения.
    """
    logger.info('Пользователь вызвал команду /help.')
    # создаем inline клавиатуру
    markup = types.InlineKeyboardMarkup()
    # создаем кнопки с callback_data - командами
    sleep_button = types.InlineKeyboardButton("Сладких снов 😴", callback_data='/sleep')
    wake_button = types.InlineKeyboardButton("Я проснулся ☀", callback_data='/wake')
    quality_button = types.InlineKeyboardButton("Качество сна 💫", callback_data='/quality')
    notes_button = types.InlineKeyboardButton("Заметки 📝", callback_data='/notes')
    recom_button = types.InlineKeyboardButton("Общие рекомендации 🧘🏼‍♀️", callback_data='/recom')
    statis_inl_button = types.InlineKeyboardButton("Статистика сна 📊💤", callback_data='/statis')
    # добавляем кнопки на клавиатуру
    markup.add(sleep_button, wake_button)
    markup.add(quality_button, notes_button)
    markup.add(recom_button)
    markup.add(statis_inl_button)

    bot.send_message(message.chat.id, """Список доступных команд:
    /sleep - начало сна. Выбирайте эту команду, когда ложитесь спать!(или кнопка 'Сладких снов 😴')
    /wake - конец сна. Выбирайте эту команду, когда проснулись!(или кнопка 'Я проснулся ☀')
    /quality - оценка качества сна по 5-бальной шкале. Выбирайте эту команду, когда хотите поставить оценку качества своему сну!(или кнопка 'Качество сна 💫')
    /notes - Ваш дневник для заметок. Выбирайте эту команду, когда хотите добавить комментарий к оценке качества Вашего сна!(или кнопка 'Заметки 📝')
    /recom - общие рекомендации для улучшения качества сна (или кнопка 'Общие рекомендации 🧘🏼‍♀️')
    /statis - cтатистика Вашего сна. Выбирайте эту команду, когда хотите получить статистику Вашего сна, в нее входят:
    общее количество сессий сна, общая и средняя продолжительность сна (или кнопка 'Статистика сна 📊💤')
    /help - пришлю список доступных команд 📃
    /start - перезапуск бота 🔁
    Важно! Поставить оценку качества сна и комментарий к ней Вы можете только в день завершения сессии сна💫
    Также Вы можете использовать кнопки ниже :""", reply_markup=markup)
    logger.debug('Отправка сообщения со списком доступных команд.')


@bot.message_handler(commands=['recom'])
def handle_recom(message: types.Message):
    """
    Обрабатывает команду recom. Отправляем пользователю сообщение с общими рекомендациями.
    :param message: types.Message: Объект сообщения.
    """
    logger.info('Пользователь вызвал команду /recom.')
    bot.send_message(message.chat.id, """✨Общие рекомендации для улучшения качества сна:

1. Старайтесь ложиться спать до 22:00 🌌

2. Спите не менее 8 часов в день ⏰

3. Добавляйте дополнительно дневной сон,
если плохо или мало спали ночью 🛌

4. Не кушайте тяжелую пищу перед сном и в целом не стоит есть за 1,5-2 часа до сна 🍽️

5. Убирайте гаджеты как минимум за 30 минут до сна 📱💻

6. Пользуйтесь берушами, если Вы чутко спите 🙉

7. Полезно пить чай с мелиссой, он обладает мягким успокаивающим и расслабляющим эффектом 🍵""")
    logger.debug('Отправка сообщения с рекомендациями.')


def calculate_sleep_statistics(user_id: int) -> str:
    """
    Преобразовывает полученную статистику сна в часы и минуты.
    :param user_id: int: ID пользователя в телеграмме.
    :return: str: Текст со статистикой сна или с уведомлением о том, что данных о сне нет.
    """
    try:
        total_session, total_sleep_duration_sec, average_sleep_duration_sec = db.get_sleep_statistic(user_id)
        # Проверка, есть ли у пользователя данные о сне
        if total_session == 0:
            logger.info('У пользователя пока нет данных о сне.')
            return "У Вас пока нет данных о сне.🙃"

        # Преобразование в часы и минуты
        total_hours = int(total_sleep_duration_sec // 3600)
        total_minutes = int((total_sleep_duration_sec % 3600) // 60)
        average_hours = int(average_sleep_duration_sec // 3600)
        average_minutes = int((average_sleep_duration_sec % 3600) // 60)

        # текст для пользователя
        statistics_text = f"""💤📊Ваша статистика сна:

    😴Всего сессий сна: {total_session}

    ⏳Общая продолжительность сна: {total_hours} часов {total_minutes} минут

    🛌Средняя продолжительность сна: {average_hours} часов {average_minutes} минут"""
        logger.debug('Статистика сна получена и преобразована в минуты и часы.')
        return statistics_text
    except Exception as e:
        logger.error(f'Ошибка при получении статистики сна и преобразовании в минуты и часы: {e}', exc_info=True)
        return f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔"


@bot.message_handler(commands=['statis'])
def handle_statistics(message: types.Message):
    """
    Обрабатывает команду statis.
    Вызывает функцию расчета статистики сна и отправляет пользователю результат выполнения.
    :param message: types.Message: Объект сообщения.
    """
    logger.info('Пользователь вызвал команду /statis.')
    user_id = message.chat.id
    statistics = calculate_sleep_statistics(user_id)
    logger.debug(f'Отправка сообщения со статистикой сна, пользователю ({user_id})')
    bot.send_message(user_id, statistics)


@bot.message_handler(commands=['sleep'])
def handle_sleep(message: types.Message):
    """
    Обрабатывает команду sleep.
    Проверяет наличие активной(незавершенной) сессии сна у пользователя,
    информирует, если необходимо завершить текущую сессию сна.
    Если активной сессии сна нет, начинает новую.
    :param message: types.Message: Объект сообщения.
    """
    logger.info('Пользователь вызвал команду /sleep.')
    user_id = message.chat.id
    user_name = message.from_user.first_name if message.from_user.first_name else 'Пользователь'
    # Убедимся, что пользователь есть в БД
    db.add_user(user_id, user_name)

    try:
        # Проверяем наличие активной сессии сна
        sleep_record_id, sleep_start_time = db.get_latest_unfinished_sleep_session(user_id)
        if sleep_record_id:
            markup = types.InlineKeyboardMarkup()
            wake_button = types.InlineKeyboardButton("Я проснулся ☀", callback_data='/wake')
            markup.add(wake_button)
            bot.send_message(user_id, "У Вас уже есть активная сессия сна😴\n"
                                      "Сначала завершите ее отметив свое пробуждение.😊", reply_markup=markup)
            logger.debug('Отправка сообщения о необходимости завершить текущую сессию сна.')
            logger.info(f'У пользователя ({user_id}) уже есть активная сессия сна, выполнить команду /sleep невозможно.')
            return

        # Текущая дата, для установления начала сессии сна
        current_time = datetime.now()
        new_sleep_record_id = db.start_sleep_session(user_id, current_time)
        if new_sleep_record_id:
            markup = types.InlineKeyboardMarkup()
            wake_button = types.InlineKeyboardButton("Я проснулся ☀", callback_data='/wake')
            markup.add(wake_button)
            bot.send_message(user_id, "Отмечено время начала сна.\nСладких снов!✨\nНе забудьте отметить свое пробуждение!")
            logger.debug('Отмечено время начала сна.')
            bot.send_message(user_id, "Отметить пробуждение: ", reply_markup=markup)
            logger.debug('Отправка кнопки для отметки пробуждения.')
        else:
            bot.send_message(user_id, "Простите, не удалось начать сессию сна. Попробуйте еще раз.😔")
            logger.warning('Не удалось начать новую сессию сна. Проверьте логи для подробной информации.')

    except Exception as e:
        bot.send_message(user_id, f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔")
        logger.error(f'Ошибка при выполнении функции-обработчика команды /sleep: {e}', exc_info=True)


@bot.message_handler(commands=['wake'])
def handle_wake(message: types.Message):
    """
    Обработчик команды wake.
    Ищет последнюю незавершенную сессию сна, информирует, если нет такой и необходимо отметить начало сна.
    Если сессия найдена, завершает ее и рассчитывает продолжительность сна за эту сессию.
    Отправляет пользователю информативное сообщение с продолжительностью сна и предложением оценить его качество.
    :param message: types.Message: Объект сообщения.
    """
    logger.info('Пользователь вызвал команду /wake.')
    user_id = message.chat.id
    user_name = message.from_user.first_name if message.from_user.first_name else 'Пользователь'
    db.add_user(user_id, user_name)
    try:
        # Ищем последнюю незавершенную сессию сна
        sleep_record_id, sleep_start_time = db.get_latest_unfinished_sleep_session(user_id)
        if sleep_record_id:
            sleep_end_time = datetime.now()
            # Завершаем найденную сессию сна
            db.end_sleep_session(sleep_record_id, sleep_end_time)

            # Рассчитываем продолжительность сна за эту сессию
            duration = sleep_end_time - sleep_start_time
            duration_hours = int(duration.total_seconds() // 3600)
            duration_minutes = int((duration.total_seconds() % 3600) // 60)

            markup_q = types.InlineKeyboardMarkup()
            quality_button = types.InlineKeyboardButton("Качество сна 💫", callback_data='/quality')
            markup_q.add(quality_button)
            bot.send_message(user_id,
                             f"Надеюсь Вы выспались!☀ Вы спали, примерно, {duration_hours} часов {duration_minutes} минут.\n"
                             f"Не забудьте поставить оценку Вашему сну сегодня!😌")
            logger.debug('Отправка информативного сообщения с продолжительностью сна и предложением оценить его качество.')
            bot.send_message(user_id, "Поставить оценку: ", reply_markup=markup_q)
            logger.debug('Отправка кнопки для оценки качества сна.')
        else:
            markup_s = types.InlineKeyboardMarkup()
            sleep_button = types.InlineKeyboardButton("Сладких снов 😴", callback_data='/sleep')
            markup_s.add(sleep_button)
            bot.send_message(user_id, "Сначала отметьте, когда легли спать.😊", reply_markup=markup_s)
            logger.debug('Отправка сообщения, с кнопкой, о необходимо отметить начало сна.')
            logger.info(f'У пользователя ({user_id}) нет активной сессии сна, выполнить команду /wake невозможно.')

    except Exception as e:
        bot.send_message(user_id, f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔")
        logger.error(f'Ошибка при выполнении функции-обработчика команды /wake: {e}', exc_info=True)


@bot.message_handler(commands=['quality'])
def handle_quality(message: types.Message):
    """
    Обработчик команды quality.
    Ищет последнюю завершенную сессию без оценки качества сна,
    информирует, если необходимо отметить свое пробуждение или оценка уже поставлена.
    Создает клавиатуру и кнопки с оценками от 1 до 5, отправляет их пользователю вместе с краткой информацией об оценках.
    :param message: types.Message: Объект сообщения.
    """
    logger.info('Пользователь вызвал команду /quality.')
    user_id = message.chat.id
    user_name = message.from_user.first_name if message.from_user.first_name else 'Пользователь'
    db.add_user(user_id, user_name)
    try:
        # Ищем последнюю завершенную сессию сегодня без оценки качества сна
        today = datetime.now().date()
        sleep_record_id, _, _ = db.get_latest_finished_sleep_session_without_quality(user_id, date=today)
        if sleep_record_id:
            # Создаем клавиатуру и кнопки с оценками от 1 до 5
            keyboard = types.InlineKeyboardMarkup()
            for i in range(1, 6):
                button = types.InlineKeyboardButton(str(i), callback_data=f'quality_{i}_{sleep_record_id}')
                keyboard.add(button)
            bot.send_message(user_id, """Оцените, пожалуйста, качество Вашего сна сегодня!

            Оценка не обязательно должна в точности соответствовать описанию.
            Достаточно, чтобы она подходила лучше остальных, а особенности и отличия укажите в комментарии к оценке.

            1️⃣ Очень плохо спалось, хуже некуда. Чувствую себя подавленно и разбито...

            2️⃣ Спалось плохо,очень чутко. Хочется поскорее вернуться в кроватку.

            3️⃣ Долго не получалось уснуть, но в целом спалось нормально.

            4️⃣ Спалось хорошо, но не против еще поваляться в кроватке.

            5️⃣ Спалось очень хорошо, удалось выспаться, чувствую себя отлично!""", reply_markup=keyboard)
            logger.debug('Отправка сообщения с кнопками для оценки качества сна.')
        else:
            markup = types.InlineKeyboardMarkup()
            wake_button = types.InlineKeyboardButton("Я проснулся ☀", callback_data='/wake')
            markup.add(wake_button)
            bot.send_message(user_id, "Сначала отметьте свое пробуждение,"
                                      " или Вы уже оценили свой последний сон.😊", reply_markup=markup)
            logger.debug('Отправка сообщения, с кнопкой, о необходимости отметить свое пробуждение или оценка уже поставлена.')
            logger.info(f'У пользователя ({user_id}) нет завершенной сессии сна без оценки,'
                        f' выполнить команду /quality невозможно.')
    except Exception as e:
        bot.send_message(user_id, f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔")
        logger.error(f'Ошибка при выполнении функции-обработчика команды /quality: {e}', exc_info=True)


@bot.callback_query_handler(func=lambda call: call.data.startswith("quality_"))
def handle_quality_callback(call: types.CallbackQuery):
    """
    Обрабатывает нажатие на кнопки оценки качества сна.
    Извлекает из callback_data необходимые данные (оценка, ID сессии), предварительно разделив на части.
    Добавляет оценку качества сна, для найденной ранее сессии, в базу данных.
    :param call: types.CallbackQuery: Объект CallbackQuery, содержащий данные о нажатой inline - кнопке.
    """
    logger.info('Обработка нажатия на кнопки оценки качества сна.')
    user_id = call.from_user.id
    try:
        parts = call.data.split('_')
        # Оценка качества сна
        quality = int(parts[1])
        # ID сессии сна, которой поставили оценку
        sleep_record_id = int(parts[2])

        # Добавляем оценку в базу данных
        db.update_sleep_quality(sleep_record_id, quality)

        markup = types.InlineKeyboardMarkup()
        notes_button = types.InlineKeyboardButton("Заметки 📝", callback_data='/notes')
        markup.add(notes_button)
        # изменяем сообщение, с кнопками для оценки качества сна,
        # после нажатия пользователем на какую-то из предложенных кнопок, на сообщение указанное ниже
        bot.edit_message_text(chat_id=user_id, message_id=call.message.message_id,
                              text=f"Ваша оценка качества сна {quality} записана! Вы можете написать комментарий к оценке"
                                   f" после команды /notes или кнопки :", reply_markup=markup)
        logger.debug('Изменение сообщения, с кнопками для оценки качества сна, после нажатия на кнопку.')

    except Exception as e:
        bot.send_message(call.message.chat.id, f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔")
        logger.error(f'Ошибка при выполнении обработки нажатия на кнопки оценки качества сна: {e}', exc_info=True)

    # подтверждение того, что запрос был получен и обработан
    bot.answer_callback_query(call.id)


@bot.message_handler(commands=['notes'])
def handle_notes(message: types.Message):
    """
    Обработчик команды notes. Позволяет добавлять или обновлять заметки к сессиям сна.
    Ищет сессию с оценкой качества сна, информирует, если такой нет и необходимо сначала поставить оценку.
    Проверяет есть ли уже заметка к найденной сессии сна, информирует, если заметка указна и ее можно обновить.
    :param message: types.Message: Объект сообщения.
    """
    logger.info('Пользователь вызвал команду /notes.')
    user_id = message.chat.id
    user_name = message.from_user.first_name if message.from_user.first_name else 'Пользователь'
    db.add_user(user_id, user_name)

    try:
        today = datetime.now().date()
        # Ищем сессию с оценкой качества сна
        sleep_record_data = db.get_latest_finished_sleep_session_with_quality(user_id, date=today)
        if sleep_record_data:
            sleep_record_id, _, _ = sleep_record_data

            # Проверяем наличие заметки к найденной сессии сна
            existing_note = db.get_note_by_sleep_record_id(sleep_record_id)
            if existing_note:
                markup_n = types.InlineKeyboardMarkup()
                button_yes = types.InlineKeyboardButton('Да, обнови', callback_data=f'update_yes_{sleep_record_id}')
                button_no = types.InlineKeyboardButton('Нет', callback_data=f'update_no_{sleep_record_id}')
                markup_n.add(button_yes, button_no)
                bot.send_message(user_id, f'У вас уже есть заметка к последней оцененной сессии сна: "{existing_note}".'
                                          f'Хотите обновить текущую заметку?', reply_markup=markup_n)
                logger.debug('Отправка сообщения, с кнопками, с предложением обновить текущую заметку.')
                logger.info(f'У пользователя ({user_id}) уже есть заметка к последней оцененной сессии сна.')
            else:
                bot.send_message(user_id, "Пожалуйста, напишите комментарий к Вашей оценке сна "
                                          "текстом в одном сообщении, я все записываю!"
                                          "\nДля отмены напишите /cancel или /stop, просто 'Отмена' тоже подойдет.😊")
                logger.debug('Отправка сообщения с просьбой написать комментарий к оценке качества сна.')
                logger.info(f'У пользователя ({user_id}) заметки к последней оцененной сессии сна не найдено.')
                # задаем следующий шаг бота, а именно,
                # вызываем функцию записи комментария пользователя к оценке качества сна и передаем sleep_record_id
                bot.register_next_step_handler(message, process_notes_step, sleep_record_id)
        else:
            markup = types.InlineKeyboardMarkup()
            quality_button = types.InlineKeyboardButton("Качество сна 💫", callback_data='/quality')
            markup.add(quality_button)
            bot.send_message(user_id, "У Вас нет завершенной сессии сна с оценкой качества, "
                                      "к которой можно добавить заметку. "
                                      "Пожалуйста, сначала оцените сон.😊", reply_markup=markup)
            logger.debug('Отправка сообщения, с кнопкой, о необходимости оценить качество сна.')
            logger.info(f'У пользователя ({user_id}) нет завершенной сессии сна с оценкой качества,'
                        f' выполнить команду /notes невозможно. ')
    except Exception as e:
        bot.send_message(user_id, f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔")
        logger.error(f'Ошибка при выполнении функции-обработчика команды /notes: {e}', exc_info=True)


@bot.callback_query_handler(func=lambda call: call.data.startswith("update_"))
def handle_notes_update_callback(call: types.CallbackQuery):
    """
    Обрабатывает нажатие на кнопки согласия или отказа в обновлении текущей заметки к оценке качества сна.
    :param call: types.CallbackQuery: Объект CallbackQuery, содержащий данные о нажатой inline - кнопке.
    """
    logger.info('Обработка нажатия на кнопки согласия или отказа в обновлении текущей заметки к оценке качества сна.')
    user_id = call.from_user.id
    try:
        parts = call.data.split('_')
        yes_no = parts[1]
        sleep_record_id = int(parts[2])
        if yes_no == 'yes':
            bot.edit_message_text(chat_id=user_id, message_id=call.message.message_id,
                                  text='Пожалуйста, напишите новый комментарий текстом, чтобы обновить ее. '
                                       '\nДля отмены напишите /cancel или /stop, просто "Отмена" тоже подойдет.😊')
            logger.debug('Отправка сообщения с просьбой написать новый комментарий к оценке качества сна.')
            logger.info('Пользователь подтвердил обновление заметки.')
            bot.register_next_step_handler(call.message, process_notes_step, sleep_record_id)
        elif yes_no == 'no':
            bot.edit_message_text(chat_id=user_id, message_id=call.message.message_id,
                                  text='Хорошо, Ваша заметка останется без изменений.😊')
            logger.debug('Отправка сообщения с подтверждением отмены обновления заметки.')
            logger.info('Пользователь отказался от обновления заметки.')
    except Exception as e:
        bot.send_message(user_id, f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔")
        logger.error(f'Ошибка при выполнении обработки нажатия на кнопки согласия или отказа в обновлении заметки: {e}', exc_info=True)

    # подтверждение того, что запрос был получен и обработан
    bot.answer_callback_query(call.id)


def process_notes_step(message: types.Message, sleep_record_id: int):
    """
    Записывает или обновляет комментарий к оценке сна.
    Проверяет, что пользователь отправил именно текст.
    Если отправлено стоп слово(команда) или команда другой функции, запись заметки отменяется.
    :param message: types.Message: Объект сообщения.
    :param sleep_record_id: int: ID сессии сна.
    """
    user_id = message.chat.id

    # Проверка на тип данных (текст, не команда или стоп слово)
    if not message.text:
        logger.warning(f'Пользователь {user_id} отправил некорректный тип данных вместо текста заметки.')
        # Уведомляем пользователя
        bot.send_message(user_id, '⚠️Пожалуйста, отправьте заметку текстом (можно со смайликами). '
                                  'Стикеры, фото или файлы я пока не умею сохранять в заметки.\n'
                                  'Для отмены напишите /cancel или /stop, просто "Отмена" тоже подойдет.😊')

        # Снова вызываем этот же шаг, чтобы бот продолжил ждать текст
        bot.register_next_step_handler(message, process_notes_step, sleep_record_id)
        # Выходим из функции, чтобы код ниже не выполнился
        return

    # Чистим тест от лишних пробелов и приводим к нижнему регистру
    user_input = message.text.strip()
    user_input_lower = user_input.lower()

    # Проверка на стоп-слова(команды)
    if user_input_lower in ['/cancel', '/stop', 'отмена']:
        bot.send_message(user_id, 'Действие отменено. Заметка не сохранена.❌')
        logger.info(f'Пользователь {user_id} отменил ввод заметки словом/командой: {user_input}.')
        return

    # Проверка на любую другую команду
    if user_input.startswith('/'):
        bot.send_message(user_id, 'Ввод заметки прерван, так как Вы ввели другую команду.')
        logger.info(f'Пользователь {user_id} прервал ввод заметки командой: {user_input}.')
        return

    # Если все в порядке выполняем сохранение заметки
    logger.info('Выполнение записи или обновления комментария к оценке качества сна.')
    try:
        # add_note() самостоятельно поймет, обновить или добавить комментарий
        # сохраняем оригинальный текст(с регистром пользователя)
        db.add_note(sleep_record_id, user_input)
        bot.send_message(user_id, "Спасибо, Ваш комментарий записан!✅")
        logger.debug('Отправка сообщения об успешной записи заметки.')
    except Exception as e:
        bot.send_message(user_id, f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔")
        logger.error(f'Ошибка при выполнении записи/обновления заметки: {e}', exc_info=True)


@bot.callback_query_handler(func=lambda call: True)
def handle_callback(call: types.CallbackQuery):
    """
    Обрабатывает нажатия на inline кнопки.
    Каждой кнопке соответствует определенная команда, для этой команды вызывается ее функция-обработчик.
    :param call: types.CallbackQuery: Объект CallbackQuery, содержащий данные о нажатой inline - кнопке.
    """
    logger.info('Выполнение обработки нажатия на inline кнопки основных команд '
                '(sleep, wake, quality, notes, recom, statis).')
    try:
        if call.data == '/sleep':
            handle_sleep(call.message)

        elif call.data == '/wake':
            handle_wake(call.message)

        elif call.data == '/quality':
            handle_quality(call.message)

        elif call.data == '/notes':
            handle_notes(call.message)

        elif call.data == '/recom':
            handle_recom(call.message)

        elif call.data == '/statis':
            handle_statistics(call.message)

    except Exception as e:
        bot.send_message(call.message.chat.id, f"Простите, произошла ошибка {e}. Попробуйте еще раз.😔")
        logger.error(f'Ошибка при выполнении обработки нажатия на inline кнопки основных команд: {e}', exc_info=True)

    # подтверждение того, что запрос был получен и обработан
    bot.answer_callback_query(call.id)


@bot.message_handler(func=lambda message: True)
def all_other_message(message: types.Message):
    """
    Обрабатывает все иные сообщения от пользователя.
    Просто текстовые сообщения вне комментария к оценке, фото, видео и тд.
    :param message: types.Message: Объект сообщения.
    """
    user_id = message.chat.id
    bot.reply_to(message, "Простите, я Вас не понимаю.😔\nПожалуйста, используйте кнопки или команды.😊")
    logger.debug('Отправка сообщения в случае необрабатываемых ботом сообщений от пользователя.')
    logger.info(f'Пользователь ({user_id}) отправил боту необрабатываемое сообщение.')


def main():
    """ Основная функция запуска Telegram-бота. """
    try:
        logger.info('Telegram-бот запущен и готов к работе.')
        bot.polling(non_stop=True, interval=0)
    except Exception as e:
        logger.critical(f'Критическая ошибка: {e}', exc_info=True)


if __name__ == '__main__':
    main()





