import os
import telebot
from telebot import types
from datetime import datetime
from collections import defaultdict
import json
# Импортируем DatabaseManager, в нем вся логика работы с БД
from db_manager import DatabaseManager

# --- Инициализация бота и базы данных ---
# Токен в переменной окружения
MY_TOKEN_BOT = os.getenv("API_TOKEN")
bot = telebot.TeleBot(MY_TOKEN_BOT)
# Инициализируем менеджер базы данных
db = DatabaseManager()


# --- Обработчики команд ---
@bot.message_handler(commands=['start'])
def send_welcome(message):
    """
    Обрабатывает команду start
    :param message:
    :return:
    """
    # ID пользователя из чата с ботом в телеграмме
    user_id = message.chat.id
    # Имя пользователя в профиле телеграмма
    user_name = message.from_user.first_name if message.from_user.first_name else 'Пользователь'
    # Добавляем пользователя в базу данных при старте
    db.add_user(user_id, user_name)

    # создаем inline клавиатуру
    markup = types.InlineKeyboardMarkup()
    # создаем кнопки с callback_data - командами
    sleep_button = types.InlineKeyboardButton("Сладких снов 😴", callback_data='/sleep')
    wake_button = types.InlineKeyboardButton("Я проснулся ☀", callback_data='/wake')
    quality_button = types.InlineKeyboardButton("Качество сна 💫", callback_data='/quality')
    notes_button = types.InlineKeyboardButton("Заметки 📝", callback_data='/notes')
    recom_button = types.InlineKeyboardButton("Общие рекомендации 🧘🏼‍♀️", callback_data='/recom')
    statis_inl_button = types.InlineKeyboardButton("Статистика сна 📊💤", callback_data='/statis')
    # Добавляем кнопки на клавиатуру
    markup.add(sleep_button, wake_button)
    markup.add(quality_button, notes_button)
    markup.add(recom_button)
    markup.add(statis_inl_button)

    # создаем Reply клавиатуру
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True)
    # создаем кнопки
    start_button = types.KeyboardButton("/start")
    help_button = types.KeyboardButton("/help")
    recom_button_reply = types.KeyboardButton("/recom")
    statis_button = types.KeyboardButton("/statis")
    # добавляем кнопки на клавиатуру
    keyboard.add(help_button, recom_button_reply)
    keyboard.add(start_button, statis_button)

    # отправляем приветственное сообщение с клавиатурой
    bot.send_message(message.chat.id, """Привет!
    Я бот, который помогает отслеживать количество и качество сна💤.
    Используйте кнопки или команды:
    /sleep - начало сна. Выбирайте эту команду, когда ложитесь спать!(или кнопка 'Сладких снов 😴')
    /wake - конец сна. Выбирайте эту команду, когда проснулись!(или кнопка 'Я проснулся ☀')
    /quality - оценка качества сна по 5-бальной шкале. Выбирайте эту команду, когда хотите поставить оценку качества своему сну!(или кнопка 'Качество сна 💫')
    /notes - Ваш дневник для заметок. Выбирайте эту команду, когда хотите добавить комментарий к оценке качества Вашего сна!(или кнопка 'Заметки 📝')
    /recom - общие рекомендации для улучшения качества сна (или кнопка 'Общие рекомендации 🧘🏼‍♀️')
    /statis - cтатистика Вашего сна. Выбирайте эту команду, когда хотите получить статистику Вашего сна, в нее входят:
    общее количество сессий сна, общая и средняя продолжительность сна (или кнопка 'Статистика сна 📊💤')
    /help - пришлю список доступных команд
    /start - перезапуск бота
    Важно! Поставить оценку качества сна и комментарий к ней Вы можете только в день завершения сессии сна💫""",
                     reply_markup=markup)
    bot.send_message(message.chat.id, """Кнопки с этими командами будут всегда доступны:
    /help - пришлю список доступных команд
    /recom - общие рекомендации для улучшения качества сна
    /statis - статистика сна
    /start - перезапуск бота
    Они находятся под строкой ввода сообщения, или рядом со значком микрофона""", reply_markup=keyboard)


@bot.message_handler(commands=['help'])
def handle_help(message):
    """
    Обрабатывает команду help
    :param message:
    :return:
    """
    # создаем inline клавиатуру
    markup = types.InlineKeyboardMarkup()
    # создаем кнопки с callback_data - командами
    sleep_button = types.InlineKeyboardButton("Сладких снов 😴", callback_data='/sleep')
    wake_button = types.InlineKeyboardButton("Я проснулся ☀", callback_data='/wake')
    quality_button = types.InlineKeyboardButton("Качество сна 💫", callback_data='/quality')
    notes_button = types.InlineKeyboardButton("Заметки 📝", callback_data='/notes')
    recom_button = types.InlineKeyboardButton("Общие рекомендации 🧘🏼‍♀️", callback_data='/recom')
    statis_inl_button = types.InlineKeyboardButton("Статистика сна 📊💤", callback_data='/statis')
    # добавляем кнопки на клавиатуру
    markup.add(sleep_button, wake_button)
    markup.add(quality_button, notes_button)
    markup.add(recom_button)
    markup.add(statis_inl_button)

    # отправляем сообщение с доступными командами и клавиатурой
    bot.send_message(message.chat.id, """Список доступных команд:
    /sleep - начало сна. Выбирайте эту команду, когда ложитесь спать!(или кнопка 'Сладких снов 😴')
    /wake - конец сна. Выбирайте эту команду, когда проснулись!(или кнопка 'Я проснулся ☀')
    /quality - оценка качества сна по 5-бальной шкале. Выбирайте эту команду, когда хотите поставить оценку качества своему сну!(или кнопка 'Качество сна 💫')
    /notes - Ваш дневник для заметок. Выбирайте эту команду, когда хотите добавить комментарий к оценке качества Вашего сна!(или кнопка 'Заметки 📝')
    /recom - общие рекомендации для улучшения качества сна (или кнопка 'Общие рекомендации 🧘🏼‍♀️')
    /statis - cтатистика Вашего сна. Выбирайте эту команду, когда хотите получить статистику Вашего сна, в нее входят:
    общее количество сессий сна, общая и средняя продолжительность сна (или кнопка 'Статистика сна 📊💤')
    /help - пришлю список доступных команд 📃
    /start - перезапуск бота 🔁
    Важно! Поставить оценку качества сна и комментарий к ней Вы можете только в день завершения сессии сна💫
    Также Вы можете использовать кнопки ниже :""", reply_markup=markup)


@bot.message_handler(commands=['recom'])
def handle_recom(message):
    """
    Обрабатывает команду recom
    :param message:
    :return:
    """
    # отправляем пользователю сообщение с общими рекомендациями
    bot.send_message(message.chat.id, """✨Общие рекомендации для улучшения качества сна:

1. Старайтесь ложиться спать до 22:00 🌌

2. Спите не менее 8 часов в день ⏰

3. Добавляйте дополнительно дневной сон,
если плохо или мало спали ночью 🛌

4. Не кушайте тяжелую пищу перед сном и в целом не стоит есть за 1,5-2 часа до сна 🍽️

5. Убирайте гаджеты как минимум за 30 минут до сна 📱💻

6. Пользуйтесь берушами, если Вы чутко спите 🙉

7. Полезно пить чай с мелиссой, он обладает мягким успокаивающим и расслабляющим эффектом 🍵""")



